Table of Contents
 Class ConcreteBlock
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Data of concrete block
public class ConcreteBlock
Inheritance
object
ConcreteBlock
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Height
Height of ConcreteBlock
public double Height { get; set; }
Property Value
double
 Lenght
Lenght of ConcreteBlock
public double Lenght { get; set; }
Property Value
double
 Material
Material of ConcreteBlock
public string Material { get; set; }
Property Value
string
 Width
Width of ConcreteBlock
public double Width { get; set; }
Property Value
double
 Edit this page